WebSwarm/app/views/users/index.html.erb

SELECT "swarm_behaviors".* FROM "swarm_behaviors" WHERE "swarm_behaviors"."user_id" = ?  [["user_id", 1]]
---
        <td><%= user.school %></td>
        <td><%= user.swarm_behaviors.map do |item| item.id end %></td>