WebSwarm/app/controllers/swarm_behaviors_controller.rb

SELECT "swarm_behaviors".* FROM "swarm_behaviors" WHERE "swarm_behaviors"."rating" = 0 LIMIT 1
---
		def set_next_swarm_behavior
			@swarm_behavior = SwarmBehavior.find_by(rating: 0)