WebSwarm/app/controllers/swarm_behaviors_controller.rb

  def index
    @swarm_behaviors = SwarmBehavior.all
---
SELECT "swarm_behaviors".* FROM "swarm_behaviors"

  def update
		if @swarm_behavior.update(swarm_behavior_params)
---
UPDATE "swarm_behaviors" SET "user_id" = ?, "updated_at" = ? WHERE "swarm_behaviors"."id" = 175  [["user_id", 2], ["updated_at", Sat, 05 Jul 2014 20:03:49 UTC +00:00]]

  def destroy
    @swarm_behavior.destroy
---
DELETE FROM "swarm_behaviors" WHERE "swarm_behaviors"."id" = ?  [["id", 1]]

		def set_next_swarm_behavior
			if(session[:user_id])
				@swarm_behaviors = SwarmBehavior.get_next_swarm_behavior(session[:user_id]).find_all_subbehaviors
			else
				authenticate_or_request_with_http_basic('WebSwarm') do |email, password|
					if @user = User.find_by(username: email, password: password)
						session[:user_id] = @user.id
						@swarm_behaviors = SwarmBehavior.find(149).find_all_subbehaviors
---
SELECT "swarm_behaviors".* FROM "swarm_behaviors" WHERE "swarm_behaviors"."user_id" = ? ORDER BY "swarm_behaviors"."id" ASC LIMIT 1  [["user_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."username" = 'Ruben' AND "users"."password" = 'Martinez' LIMIT 1
SELECT "swarm_behaviors".* FROM "swarm_behaviors" WHERE "swarm_behaviors"."id" = ? LIMIT 1  [["id", "12"]]