WebSwarm/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password", "school", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 03 Jul 2014 02:28:32 UTC +00:00], ["password", "1029rox*"], ["school", "Bowdoin"], ["updated_at", Thu, 03 Jul 2014 02:28:32 UTC +00:00], ["username", "ruben"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save